Catalogs/НастройкиРегламентныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиРегламентныхДействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВДеньОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПоРабочимДням</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГраницыПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГраницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОперацииСЦеннымиБумагами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОперацииСЦеннымиБумагами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставкиПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеклассификацияАктивовЕПС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоставкаЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеДатыРасчетаСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеДатыРасчетаСЧА</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСЧА</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПериодичностьПереоценкиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьПереоценкиАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПереоценивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжеквартальноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодноИПослеПриобретенийИРеализаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноВПоследнийРабочийДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДнейКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДнейКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиРегламентныхДействий/Ext/ManagerModule.bsl
#Область ИспользованиеВременныхТаблиц
//помещает СчетаДУ и даты начала и окончания во временные таблицы _СчетаДоверительногоУправления и _ГраницыПериодовДоговоров
Процедура ОтобратьСчетаДоверительногоУправленияИГраницыДействияДоговоров(ТекстЗапроса, СвойПериодДляКаждогоСчетаДУ = Ложь, ИмяТаблицыСчетовДУ = "_СчетаДоверительногоУправления") 
	
	// Поместим счет доверительного управления во временную таблицу
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, ДАТАВРЕМЯ(1, 1, 1)) > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Значение КАК ДАТА)
		|		ИНАЧЕ СчетаДоверительногоУправления.ДатаЗаключения
		|	КОНЕЦ КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДатаС КАК ДАТА), ДЕНЬ) КАК НачалоПериодаДействия,
		|	КОНЕЦПЕРИОДА(ВЫРАЗИТЬ(&ДатаПо КАК ДАТА), ДЕНЬ) КАК КонецПериодаДействия,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления0
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ДатаПо,
		|				СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)
		|					И ТИПЗНАЧЕНИЯ(Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ЗначенияДополнительныхСведений.Объект
		|				И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ"")
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ДатаЗаключения КАК Период
		|ПОМЕСТИТЬ _ДатаПервойОперации0
		|ИЗ
		|	_СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления
		|ГДЕ
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	МИНИМУМ(ОстаткиДенежныхСредств.Период)
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления
		|		ПО ОстаткиДенежныхСредств.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|ГДЕ
		|	ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.Период <= _СчетаДоверительногоУправления.КонецПериодаДействия
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|	МИНИМУМ(ОстаткиЦенныхБумаг.Период)
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления
		|		ПО ОстаткиЦенныхБумаг.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|ГДЕ
		|	ОстаткиЦенныхБумаг.Активность
		|	И ОстаткиЦенныхБумаг.Период <= _СчетаДоверительногоУправления.КонецПериодаДействия
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.НачалоПериодаДействия КАК НачалоПериодаДействия,
		|	СчетаДоверительногоУправления.КонецПериодаДействия КАК КонецПериодаДействия,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК Период
		|ПОМЕСТИТЬ _ДатыРасторжения
		|ИЗ
		|	_СчетаДоверительногоУправления0 КАК СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасторжения.Организация КАК Организация,
		|	_ДатыРасторжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(МИНИМУМ(_ДатаПервойОперации.Период), ДЕНЬ) < МИНИМУМ(_ДатыРасторжения.НачалоПериодаДействия)
		|			ТОГДА МИНИМУМ(_ДатыРасторжения.НачалоПериодаДействия)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(МИНИМУМ(_ДатаПервойОперации.Период), ДЕНЬ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА _ДатыРасторжения.Период > _ДатыРасторжения.КонецПериодаДействия
		|				ИЛИ _ДатыРасторжения.Период = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _ДатыРасторжения.КонецПериодаДействия
		|		ИНАЧЕ _ДатыРасторжения.Период
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ _ГраницыПериодовДоговоров
		|ИЗ
		|	_ДатыРасторжения КАК _ДатыРасторжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатаПервойОперации0 КАК _ДатаПервойОперации
		|		ПО _ДатыРасторжения.СчетДоверительногоУправления = _ДатаПервойОперации.СчетДоверительногоУправления
		|ГДЕ
		|	(_ДатыРасторжения.Период = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _ДатыРасторжения.Период >= _ДатыРасторжения.НачалоПериодаДействия)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыРасторжения.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _ДатыРасторжения.Период > _ДатыРасторжения.КонецПериодаДействия
		|				ИЛИ _ДатыРасторжения.Период = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _ДатыРасторжения.КонецПериодаДействия
		|		ИНАЧЕ _ДатыРасторжения.Период
		|	КОНЕЦ,
		|	_ДатыРасторжения.Организация
		|
		|ИМЕЮЩИЕ
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(_ДатаПервойОперации.Период), ДЕНЬ) ЕСТЬ НЕ NULL "
		+ ";
		|";
	
	//Проверим, не пришли ли даты в таблице счетовДУ
	Если СвойПериодДляКаждогоСчетаДУ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДатаС КАК ДАТА), ДЕНЬ) КАК НачалоПериодаДействия", "_СчетаДоверительногоУправления.НачалоПериодаДействия КАК НачалоПериодаДействия");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КОНЕЦПЕРИОДА(ВЫРАЗИТЬ(&ДатаПо КАК ДАТА), ДЕНЬ) КАК КонецПериодаДействия", "_СчетаДоверительногоУправления.КонецПериодаДействия КАК КонецПериодаДействия");
	КонецЕсли;
	
	Если ИмяТаблицыСчетовДУ <> "" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления", ИмяТаблицыСчетовДУ + " КАК _СчетаДоверительногоУправления");
	КонецЕсли;
	
КонецПроцедуры

//помещает настройки периодичности в  ВТ _НастройкиПериодичностиПоСчетуДУ
Процедура ОтобратьНастройкиПериодичностиЗаПериод(ТекстЗапроса, ВидДействия) 
	
	ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиФормирования.Период КАК Период,
		|	НастройкиФормирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиФормирования.ПериодичностьРасчетаСЧА КАК Периодичность,
		|	_ГраницыПериодовДоговоров.ДатаНачала КАК ДатаНачала,
		|	_ГраницыПериодовДоговоров.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _ВсеНастройки
		|ИЗ
		|	_ГраницыПериодовДоговоров КАК _ГраницыПериодовДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФормированияСЧА КАК НастройкиФормирования
		|		ПО _ГраницыПериодовДоговоров.СчетДоверительногоУправления = НастройкиФормирования.СчетДоверительногоУправления
		|			И (НастройкиФормирования.Период <= _ГраницыПериодовДоговоров.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеНастройки.Период КАК Период,
		|	_ВсеНастройки.ДатаНачала КАК ДатаНачала,
		|	_ВсеНастройки.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА _ВсеНастройки.Период > _ВсеНастройки.ДатаНачала
		|			ТОГДА _ВсеНастройки.Период
		|		ИНАЧЕ _ВсеНастройки.ДатаНачала
		|	КОНЕЦ КАК ДатаС,
		|	_ВсеНастройки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеНастройки.Периодичность КАК ПериодичностьДействия,
		|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(_ВсеНастройки1.Период), ДЕНЬ, -1), _ВсеНастройки.ДатаОкончания) КАК ДатаПо
		|ПОМЕСТИТЬ _ПериодичностьНастроекПоСчетамДУ0
		|ИЗ
		|	_ВсеНастройки КАК _ВсеНастройки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройки КАК _ВсеНастройки1
		|		ПО _ВсеНастройки.СчетДоверительногоУправления = _ВсеНастройки1.СчетДоверительногоУправления
		|			И _ВсеНастройки.Период < _ВсеНастройки1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеНастройки.Период,
		|	_ВсеНастройки.ДатаНачала,
		|	_ВсеНастройки.ДатаОкончания,
		|	_ВсеНастройки.СчетДоверительногоУправления,
		|	_ВсеНастройки.Периодичность,
		|	ВЫБОР
		|		КОГДА _ВсеНастройки.Период > _ВсеНастройки.ДатаНачала
		|			ТОГДА _ВсеНастройки.Период
		|		ИНАЧЕ _ВсеНастройки.ДатаНачала
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(МИНИМУМ(_ВсеНастройки1.Период), _ВсеНастройки.ДатаОкончания) >= _ВсеНастройки.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодичностьНастроекПоСчетамДУ0.Период КАК Период,
		|	ВЫРАЗИТЬ(_ПериодичностьНастроекПоСчетамДУ0.ДатаС КАК ДАТА) КАК ДатаС,
		|	_ПериодичностьНастроекПоСчетамДУ0.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодичностьНастроекПоСчетамДУ0.СчетДоверительногоУправления.Организация КАК Организация,
		|	_ПериодичностьНастроекПоСчетамДУ0.ПериодичностьДействия КАК ПериодичностьДействия,
		|	_ПериодичностьНастроекПоСчетамДУ0.ПериодичностьДействия.ВДеньОперации КАК ВДеньОперации,
		|	ВЫРАЗИТЬ(_ПериодичностьНастроекПоСчетамДУ0.ДатаПо КАК ДАТА) КАК ДатаПо
		|ПОМЕСТИТЬ _ПериодичностьНастроекПоСчетамДУ
		|ИЗ
		|	_ПериодичностьНастроекПоСчетамДУ0 КАК _ПериодичностьНастроекПоСчетамДУ0
		|ГДЕ
		|	_ПериодичностьНастроекПоСчетамДУ0.ДатаС <= _ПериодичностьНастроекПоСчетамДУ0.ДатаПо"
		+ ";
		|";
	
	
		Если ВидДействия = "СЧА" Тогда
		//ЭТО ШАБЛОН ДЛЯ ДРУГОГО ДЕЙТСВИЯ КРОМЕ СЧА	
		////нужно заменить имя регистра сведений
		//Запрос.Текст = СтрЗаменить(Запрос.Текст,"НастройкиФормированияСЧА", "НастройкиФормированияСЧА");
		//// нужно заменить имя ресурса регистра
		//Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПериодичностьРасчетаСЧА", "ПериодичностьРасчетаСЧА");
	Иначе
		ВызватьИсключение "Не определено получение настройки периодичности для действия """ + ВидДействия + """";
	КонецЕсли;
	
КонецПроцедуры

//помещает даты по календарю в  ВТ _ОтчетныеДатыПоКалендарю
Процедура ОтобратьКалендарныеДатыДействияЗаПериод(ТекстЗапроса) 
	
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодичностьНастроекПоСчетамДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодичностьНастроекПоСчетамДУ.ДатаС КАК ПериодС,
		|	_ПериодичностьНастроекПоСчетамДУ.ДатаПо КАК ПериодПо,
		|	_ПериодичностьНастроекПоСчетамДУ.ПериодичностьДействия КАК ПериодичностьДействия,
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА ДанныеКалендаря.Дата
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежеквартально)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежегодно)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, ГОД)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА ДанныеКалендаря.Дата
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|			ТОГДА КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежеквартально)
		|			ТОГДА КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежегодно)
		|			ТОГДА КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ГОД)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК КонецПериода,
		|	ДанныеКалендаря.ВидДня КАК ВидДня,
		|	НастройкиРегламентныхДействийНастройки.Периодичность КАК Периодичность,
		|	НастройкиРегламентныхДействийНастройки.ТолькоПоРабочимДням КАК ТолькоПоРабочимДням,
		|	НастройкиРегламентныхДействийНастройки.ВидГраницыПериода КАК ВидГраницыПериода,
		|	ВЫБОР
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА ДанныеКалендаря.Дата
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежеквартально)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|		КОГДА НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежегодно)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, ГОД)
		|		ИНАЧЕ ДанныеКалендаря.Дата
		|	КОНЕЦ КАК Период
		|ПОМЕСТИТЬ _ДниПоПериодамСГраницамиПериодов
		|ИЗ
		|	_ПериодичностьНастроекПоСчетамДУ КАК _ПериодичностьНастроекПоСчетамДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиРегламентныхДействий.Настройки КАК НастройкиРегламентныхДействийНастройки
		|		ПО (НастройкиРегламентныхДействийНастройки.Ссылка = _ПериодичностьНастроекПоСчетамДУ.ПериодичностьДействия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (НастройкиРегламентныхДействийНастройки.ТолькоПоРабочимДням
		|					И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|				ИЛИ НЕ НастройкиРегламентныхДействийНастройки.ТолькоПоРабочимДням)
		|			И (ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(_ПериодичностьНастроекПоСчетамДУ.ДатаС, ГОД) И КОНЕЦПЕРИОДА(_ПериодичностьНастроекПоСчетамДУ.ДатаПо, ГОД))
		|			И (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДниПоПериодамСГраницамиПериодов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДниПоПериодамСГраницамиПериодов.ПериодС КАК ПериодС,
		|	ДниПоПериодамСГраницамиПериодов.ПериодПо КАК ПериодПо,
		|	ДниПоПериодамСГраницамиПериодов.ПериодичностьДействия КАК ПериодичностьДействия,
		|	ДниПоПериодамСГраницамиПериодов.НачалоПериода КАК НачалоПериода,
		|	ДниПоПериодамСГраницамиПериодов.Периодичность КАК Периодичность,
		|	МИНИМУМ(ДниПоПериодамСГраницамиПериодов.Дата) КАК НачалоПериодаПоКалендарю,
		|	МАКСИМУМ(ДниПоПериодамСГраницамиПериодов.Дата) КАК ОкончаниеПериодаПоКалендарю
		|ПОМЕСТИТЬ _ГраницыПериодов
		|ИЗ
		|	_ДниПоПериодамСГраницамиПериодов КАК ДниПоПериодамСГраницамиПериодов
		|
		|СГРУППИРОВАТЬ ПО
		|	ДниПоПериодамСГраницамиПериодов.НачалоПериода,
		|	ДниПоПериодамСГраницамиПериодов.СчетДоверительногоУправления,
		|	ДниПоПериодамСГраницамиПериодов.ПериодС,
		|	ДниПоПериодамСГраницамиПериодов.ПериодПо,
		|	ДниПоПериодамСГраницамиПериодов.ПериодичностьДействия,
		|	ДниПоПериодамСГраницамиПериодов.Периодичность
		|
		|ИМЕЮЩИЕ
		|	(МИНИМУМ(ДниПоПериодамСГраницамиПериодов.Дата) МЕЖДУ ДниПоПериодамСГраницамиПериодов.ПериодС И ДниПоПериодамСГраницамиПериодов.ПериодПо
		|		ИЛИ МАКСИМУМ(ДниПоПериодамСГраницамиПериодов.Дата) МЕЖДУ ДниПоПериодамСГраницамиПериодов.ПериодС И ДниПоПериодамСГраницамиПериодов.ПериодПо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДниПоПериодамСГраницамиПериодов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДниПоПериодамСГраницамиПериодов.ПериодС КАК ПериодС,
		|	ДниПоПериодамСГраницамиПериодов.ПериодПо КАК ПериодПо,
		|	ДниПоПериодамСГраницамиПериодов.ПериодичностьДействия КАК ПериодичностьДействия,
		|	ВЫБОР
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Начало)
		|				И _ГраницыПериодов.НачалоПериодаПоКалендарю >= ДниПоПериодамСГраницамиПериодов.ПериодС
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Конец)
		|				И _ГраницыПериодов.ОкончаниеПериодаПоКалендарю <= ДниПоПериодамСГраницамиПериодов.ПериодПо
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежеквартально)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Начало)
		|				И _ГраницыПериодов.НачалоПериодаПоКалендарю >= ДниПоПериодамСГраницамиПериодов.ПериодС
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежеквартально)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Конец)
		|				И _ГраницыПериодов.ОкончаниеПериодаПоКалендарю <= ДниПоПериодамСГраницамиПериодов.ПериодПо
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежегодно)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Начало)
		|				И _ГраницыПериодов.НачалоПериодаПоКалендарю >= ДниПоПериодамСГраницамиПериодов.ПериодС
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		КОГДА ДниПоПериодамСГраницамиПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежегодно)
		|				И ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Конец)
		|				И _ГраницыПериодов.ОкончаниеПериодаПоКалендарю <= ДниПоПериодамСГраницамиПериодов.ПериодПо
		|			ТОГДА ДниПоПериодамСГраницамиПериодов.Дата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Дата,
		|	ДниПоПериодамСГраницамиПериодов.ВидДня КАК ВидДня,
		|	ДниПоПериодамСГраницамиПериодов.Периодичность КАК Периодичность,
		|	ДниПоПериодамСГраницамиПериодов.ТолькоПоРабочимДням КАК ТолькоПоРабочимДням,
		|	ДниПоПериодамСГраницамиПериодов.ВидГраницыПериода КАК ВидГраницыПериода,
		|	_ГраницыПериодов.НачалоПериода КАК Период
		|ПОМЕСТИТЬ ДниПоПериодам
		|ИЗ
		|	_ДниПоПериодамСГраницамиПериодов КАК ДниПоПериодамСГраницамиПериодов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ГраницыПериодов КАК _ГраницыПериодов
		|		ПО ДниПоПериодамСГраницамиПериодов.Период = _ГраницыПериодов.НачалоПериода
		|			И (ДниПоПериодамСГраницамиПериодов.Дата МЕЖДУ ДниПоПериодамСГраницамиПериодов.ПериодС И ДниПоПериодамСГраницамиПериодов.ПериодПо)
		|			И ДниПоПериодамСГраницамиПериодов.ПериодичностьДействия = _ГраницыПериодов.ПериодичностьДействия
		|			И ДниПоПериодамСГраницамиПериодов.Периодичность = _ГраницыПериодов.Периодичность
		|			И ДниПоПериодамСГраницамиПериодов.ПериодС = _ГраницыПериодов.ПериодС
		|			И ДниПоПериодамСГраницамиПериодов.ПериодПо = _ГраницыПериодов.ПериодПо
		|			И ДниПоПериодамСГраницамиПериодов.СчетДоверительногоУправления = _ГраницыПериодов.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДниПоПериодам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДниПоПериодам.ПериодС КАК ПериодС,
		|	ДниПоПериодам.ПериодПо КАК ПериодПо,
		|	ДниПоПериодам.ПериодичностьДействия КАК ПериодичностьДействия,
		|	ДниПоПериодам.Периодичность КАК Периодичность,
		|	ДниПоПериодам.ВидГраницыПериода КАК ВидГраницыПериода,
		|	ДниПоПериодам.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ДниПоПериодам.ВидГраницыПериода = ЗНАЧЕНИЕ(Перечисление.ВидыГраницПериода.Конец)
		|			ТОГДА МАКСИМУМ(ДниПоПериодам.Дата)
		|		ИНАЧЕ МИНИМУМ(ДниПоПериодам.Дата)
		|	КОНЕЦ КАК Дата
		|ПОМЕСТИТЬ _ОтчетныеДаты0
		|ИЗ
		|	ДниПоПериодам КАК ДниПоПериодам
		|ГДЕ
		|	ДниПоПериодам.Дата <> НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ДниПоПериодам.Периодичность,
		|	ДниПоПериодам.ВидГраницыПериода,
		|	ДниПоПериодам.Период,
		|	ДниПоПериодам.СчетДоверительногоУправления,
		|	ДниПоПериодам.ПериодС,
		|	ДниПоПериодам.ПериодПо,
		|	ДниПоПериодам.ПериодичностьДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОтчетныеДаты0.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОтчетныеДаты0.ПериодС КАК ПериодС,
		|	_ОтчетныеДаты0.ПериодПо КАК ПериодПо,
		|	_ОтчетныеДаты0.Дата КАК Дата
		|ПОМЕСТИТЬ _ОтчетныеДатыПоКалендарю
		|ИЗ
		|	_ОтчетныеДаты0 КАК _ОтчетныеДаты0
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОтчетныеДаты0.СчетДоверительногоУправления,
		|	_ОтчетныеДаты0.ПериодС,
		|	_ОтчетныеДаты0.ПериодПо,
		|	_ОтчетныеДаты0.Дата"
		+ ";
		|";
	
КонецПроцедуры

//помещает даты по календарю в  ВТ _ОтчетныеДатыПоКалендарю
Процедура ОтобратьДатыДействияПоОперациямЗаПериод(ТекстЗапроса, ВидДействия) 
	
	Если ВидДействия = "СЧА" Тогда
		ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Дата КАК Дата,
			|	ВложенныйЗапрос.ДатаНачала КАК ПериодС,
			|	ВложенныйЗапрос.ДатаОкончания КАК ПериодПо
			|ПОМЕСТИТЬ _ДатыПоДнямОпераций
			|ИЗ
			|	(ВЫБРАТЬ
			|		_ПериодыНастроек.Организация КАК Организация,
			|		_ПериодыНастроек.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) КАК Дата,
			|		_ПериодыНастроек.ДатаС КАК ДатаНачала,
			|		_ПериодыНастроек.ДатаПо КАК ДатаОкончания
			|	ИЗ
			|		_ПериодичностьНастроекПоСчетамДУ КАК _ПериодыНастроек
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
			|			ПО (_ПериодыНастроек.ДатаС ЕСТЬ НЕ NULL )
			|				И (_ПериодыНастроек.ВДеньОперации)
			|				И (ОперацииСЦеннымиБумагами.Активность)
			|				И (ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = _ПериодыНастроек.СчетДоверительногоУправления)
			|				И (ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ _ПериодыНастроек.ДатаС И КОНЕЦПЕРИОДА(_ПериодыНастроек.ДатаПо, ДЕНЬ))
			|				И (ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
			|					ИЛИ ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
			|					ИЛИ ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
			|					ИЛИ ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
			|					ИЛИ ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.Сделка
			|					ИЛИ ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.СделкаРЕПО)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_ПериодыНастроек.Организация,
			|		_ПериодыНастроек.СчетДоверительногоУправления,
			|		НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
			|		_ПериодыНастроек.ДатаС,
			|		_ПериодыНастроек.ДатаПо
			|	ИЗ
			|		_ПериодичностьНастроекПоСчетамДУ КАК _ПериодыНастроек
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
			|			ПО _ПериодыНастроек.Организация = ОстаткиДенежныхСредств.Организация
			|				И _ПериодыНастроек.СчетДоверительногоУправления = ОстаткиДенежныхСредств.СчетДоверительногоУправления
			|				И (_ПериодыНастроек.ДатаС ЕСТЬ НЕ NULL )
			|				И (_ПериодыНастроек.ВДеньОперации)
			|				И (ОстаткиДенежныхСредств.Период МЕЖДУ НАЧАЛОПЕРИОДА(_ПериодыНастроек.ДатаС, ДЕНЬ) И КОНЕЦПЕРИОДА(_ПериодыНастроек.ДатаПо, ДЕНЬ))) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Дата,
			|	ВложенныйЗапрос.ДатаНачала,
			|	ВложенныйЗапрос.ДатаОкончания"
		+ ";
		|";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определено получение настройки периодичности для действия """ + ВидДействия + """",,,,);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//помещает даты по календарю в  ВТ _ОтчетныеДатыПоКалендарю
Процедура ОтобратьДатыДействияЗаПериод(ТекстЗапроса, ИмяТаблицыДатДействияЗаПериод) 
	
	ТекстЗапроса0 =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления0.Организация КАК Организация,
		|	_СчетаДоверительногоУправления0.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОтчетныеДатыПоКалендарю.Дата КАК Дата
		|ПОМЕСТИТЬ _ДатыДействияЗаПериод
		|ИЗ
		|	_ОтчетныеДатыПоКалендарю КАК _ОтчетныеДатыПоКалендарю
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления0
		|		ПО _ОтчетныеДатыПоКалендарю.СчетДоверительногоУправления = _СчетаДоверительногоУправления0.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаДоверительногоУправления0.Организация,
		|	_СчетаДоверительногоУправления0.СчетДоверительногоУправления,
		|	ДополнительныеДатыРасчетаСЧА.ДатаСЧА
		|ИЗ
		|	_СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления0
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеДатыРасчетаСЧА КАК ДополнительныеДатыРасчетаСЧА
		|		ПО _СчетаДоверительногоУправления0.Организация = ДополнительныеДатыРасчетаСЧА.Организация
		|			И _СчетаДоверительногоУправления0.СчетДоверительногоУправления = ДополнительныеДатыРасчетаСЧА.СчетДоверительногоУправления
		|ГДЕ
		|	ДополнительныеДатыРасчетаСЧА.ДатаСЧА МЕЖДУ _СчетаДоверительногоУправления0.НачалоПериодаДействия И _СчетаДоверительногоУправления0.КонецПериодаДействия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаДоверительногоУправления0.Организация,
		|	_СчетаДоверительногоУправления0.СчетДоверительногоУправления,
		|	ЗначенияДополнительныхСведений.Значение
		|ИЗ
		|	_СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления0
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаПо, ТИПЗНАЧЕНИЯ(Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ЗначенияДополнительныхСведений.Объект
		|				И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ"")
		|		ПО _СчетаДоверительногоУправления0.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Значение МЕЖДУ _СчетаДоверительногоУправления0.НачалоПериодаДействия И _СчетаДоверительногоУправления0.КонецПериодаДействия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаДоверительногоУправления0.Организация,
		|	_СчетаДоверительногоУправления0.СчетДоверительногоУправления,
		|	_ДатыПоДнямОпераций.Дата
		|ИЗ
		|	_ДатыПоДнямОпераций КАК _ДатыПоДнямОпераций
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления0 КАК _СчетаДоверительногоУправления0
		|		ПО _ДатыПоДнямОпераций.СчетДоверительногоУправления = _СчетаДоверительногоУправления0.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления0.Организация,
		|	_СчетаДоверительногоУправления0.СчетДоверительногоУправления,
		|	_ДатыПоДнямОпераций.Дата"
		+ ";
		|";
		
		Если ИмяТаблицыДатДействияЗаПериод <> "" Тогда
			ТекстЗапроса0 = СтрЗаменить(ТекстЗапроса0, "ПОМЕСТИТЬ _ДатыДействияЗаПериод", "ПОМЕСТИТЬ " + ИмяТаблицыДатДействияЗаПериод);
		КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса0;
	
КонецПроцедуры

Процедура ДополнитьРабочимиДнями(ТекстЗапроса, ИмяТаблицыДатДействияЗаПериод)
	
	ТекстЗапроса0 =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыДействияЗаПериод.Организация КАК Организация,
		|	_ДатыДействияЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыДействияЗаПериод.Дата КАК Дата
		|ПОМЕСТИТЬ _ДатыДействияРазвернуто
		|ИЗ
		|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ГраницыПериодовДоговоров.Организация,
		|	_ГраницыПериодовДоговоров.СчетДоверительногоУправления,
		|	ДанныеКалендаря.Дата
		|ИЗ
		|	_ГраницыПериодовДоговоров КАК _ГраницыПериодовДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(_ГраницыПериодовДоговоров.ДатаНачала, ДЕНЬ) И НАЧАЛОПЕРИОДА(_ГраницыПериодовДоговоров.ДатаОкончания, ДЕНЬ))
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|ГДЕ
		|	НЕ ДанныеКалендаря.Дата ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыДействияЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДатыДействияРазвернуто.Организация КАК Организация,
		|	_ДатыДействияРазвернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыДействияРазвернуто.Дата КАК Дата
		|ПОМЕСТИТЬ _ДатыДействияЗаПериод
		|ИЗ
		|	_ДатыДействияРазвернуто КАК _ДатыДействияРазвернуто"
		+ ";
		|";
		
	Если ИмяТаблицыДатДействияЗаПериод <> "_ДатыДействияЗаПериод" Тогда	
		ТекстЗапроса0 = СтрЗаменить(ТекстЗапроса0, "_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод", ИмяТаблицыДатДействияЗаПериод + " КАК _ДатыДействияЗаПериод");
		ТекстЗапроса0 = СтрЗаменить(ТекстЗапроса0, "УНИЧТОЖИТЬ _ДатыДействияЗаПериод", "УНИЧТОЖИТЬ " + ИмяТаблицыДатДействияЗаПериод);
		ТекстЗапроса0 = СтрЗаменить(ТекстЗапроса0, "ПОМЕСТИТЬ _ДатыДействияЗаПериод", "ПОМЕСТИТЬ " + ИмяТаблицыДатДействияЗаПериод);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапроса0;
	
КонецПроцедуры

Процедура УдалитьВременныеТаблицы(ТекстЗапроса, УдалитьВсе = Ложь)
	
	ТекстЗапроса = ТекстЗапроса + 
		"
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаДоверительногоУправления0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатаПервойОперации0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыРасторжения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПериодичностьНастроекПоСчетамДУ0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДниПоПериодамСГраницамиПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ГраницыПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДниПоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОтчетныеДаты0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОтчетныеДатыПоКалендарю
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыПоДнямОпераций
		|;
		|
		|";
		
		Если УдалитьВсе Тогда
			
			ТекстЗапроса = ТекстЗапроса +			
				"
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ _ГраницыПериодовДоговоров
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ _ПериодичностьНастроекПоСчетамДУ
				|;
				|
				|";
					
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьТекстЗапросаПоДатамРегламентныхДействий(Параметры) Экспорт
	//ВидДействия пока должен быть = "СЧА"
	
	ВидДействия 					= ?(Параметры.Свойство("ВидДействия"), Параметры.ВидДействия, "");
	ДополнитьРабочимиДнями 			= ?(Параметры.Свойство("ДополнитьРабочимиДнями"), Параметры.ДополнитьРабочимиДнями, Ложь); 
	СвойПериодДляКаждогоСчетаДУ	 	= ?(Параметры.Свойство("СвойПериодДляКаждогоСчетаДУ"), Параметры.СвойПериодДляКаждогоСчетаДУ, Ложь); 
	ИмяТаблицыСчетовДУ 				= ?(Параметры.Свойство("ИмяТаблицыСчетовДУ"), Параметры.ИмяТаблицыСчетовДУ, "_СчетаДоверительногоУправления"); 
	ИмяТаблицыДатДействияЗаПериод  	= ?(Параметры.Свойство("ИмяТаблицыДатДействияЗаПериод"), Параметры.ИмяТаблицыДатДействияЗаПериод, "_ДатыДействияЗаПериод");
	УдалитьВсеВременныеТаблицы 		= ?(Параметры.Свойство("УдалитьВсеВременныеТаблицы"), Параметры.УдалитьВсеВременныеТаблицы, Ложь);	
	
	Если ВидДействия = "" Тогда
		ВызватьИсключение "Не задан вид действия!";
	КонецЕсли;
	
	ТекстЗапроса = "";
	ОтобратьСчетаДоверительногоУправленияИГраницыДействияДоговоров(ТекстЗапроса, СвойПериодДляКаждогоСчетаДУ, ИмяТаблицыСчетовДУ);
	ОтобратьНастройкиПериодичностиЗаПериод(ТекстЗапроса, ВидДействия);
	ОтобратьКалендарныеДатыДействияЗаПериод(ТекстЗапроса);
	ОтобратьДатыДействияПоОперациямЗаПериод(ТекстЗапроса, ВидДействия);	
	ОтобратьДатыДействияЗаПериод(ТекстЗапроса, ИмяТаблицыДатДействияЗаПериод);
	Если ДополнитьРабочимиДнями Тогда
		ДополнитьРабочимиДнями(ТекстЗапроса, ИмяТаблицыДатДействияЗаПериод);
	КонецЕсли;
	УдалитьВременныеТаблицы(ТекстЗапроса, УдалитьВсеВременныеТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, Параметры) Экспорт
	
	Запрос.Текст = ПолучитьТекстЗапросаПоДатамРегламентныхДействий(Параметры);
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда 
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;			
	КонецЕсли;
	
	Запрос.Параметры.Вставить("ДатаС",	Параметры.ДатаС);
	Запрос.Параметры.Вставить("ДатаПо",	Параметры.ДатаПо);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#Область ДатыДействия

Функция ПолучитьДатыДействияЗаПериод(ВидДействия, СчетДоверительногоУправления, ДатаС, ДатаПо, ДатаПроверкиНастроек, ВзятьПоследнюю = Неопределено, ОтсутствуютНастройки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Параметры.Вставить("СчетаДоверительногоУправления", СчетДоверительногоУправления);

	// Поместим счет доверительного управления во временную таблицу
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка В (&СчетаДоверительногоУправления)";
	
	Запрос.Выполнить();

	ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, Новый Структура("ВидДействия, ДатаС, ДатаПо, ДополнитьРабочимиДнями", ВидДействия, ДатаС, ДатаПо, Ложь)); 
	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ВзятьПоследнюю КАК ВзятьПоследнюю,
		|	_ДатыДействияЗаПериод.Дата КАК Дата
		|ИЗ
		|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВзятьПоследнюю КАК ВзятьПоследнюю,", ?(ВзятьПоследнюю = Истина, "Первые 1", ""));
	Запрос.Текст = Запрос.Текст + ?(ВзятьПоследнюю = Истина, " Упорядочить по _ДатыДействияЗаПериод.Дата УБЫВ","");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаНастроек = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПериодичностьНастроекПоСчетамДУ").ПолучитьДанные().Выгрузить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Дата");
	
	Если ТаблицаНастроек.Количество() = 0 Тогда
		ОтсутствуютНастройки = Истина;
		//Результат = Неопределено;
	Иначе
		
		//проверим настройки на начало и конец периода
		ОтсутствуютНастройки = Истина;
		Для Каждого СтрокаНастройки из ТаблицаНастроек Цикл
			Если СтрокаНастройки.ДатаС <= НачалоДня(ДатаПроверкиНастроек) Тогда
				ОтсутствуютНастройки = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		//Если ОтсутствуютНастройки Тогда
		//	Результат = Неопределено;
		//КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуПредыдущегоДействия(ВидДействия, СчетДоверительногоУправления, Дата, ОтсутствуютНастройки = Ложь) Экспорт
	
	Возврат Кэширование.ПолучитьДатуПредыдущегоДействия(ВидДействия, СчетДоверительногоУправления, Дата, ОтсутствуютНастройки);
	
КонецФункции

#КонецОбласти

#Область ДатыСЧА

//ок
Функция ПолучитьДатыРасчетаСЧАЗаПериод(СчетДоверительногоУправления, ДатаС, ДатаПо, ВзятьПоследнюю = Неопределено, ОтсутствуютНастройки = Ложь) Экспорт
	
	Возврат ПолучитьДатыДействияЗаПериод("СЧА", СчетДоверительногоУправления, ДатаС, ДатаПо, ДатаПо, ВзятьПоследнюю, ОтсутствуютНастройки)
	
КонецФункции

Функция ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(СчетДоверительногоУправления, ДатаС, ДатаПо, ОтсутствуютНастройки = Ложь) Экспорт
	
	МассивСДатой = ПолучитьДатыРасчетаСЧАЗаПериод(СчетДоверительногоУправления, ДатаС, ДатаПо, Истина, ОтсутствуютНастройки);
	
	Если ОтсутствуютНастройки Тогда
		Возврат Неопределено; 
	ИначеЕсли МассивСДатой.Количество() = 1 Тогда
		Возврат МассивСДатой[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуПоследнегоПрошлогоднегоРасчетаСЧА(СчетДоверительногоУправления, Дата, ОтсутствуютНастройки = Ложь) Экспорт
	
	МассивСДатой = ПолучитьДатыДействияЗаПериод("СЧА", СчетДоверительногоУправления,  НачалоГода(НачалоГода(Дата)-1), НачалоГода(Дата)-1, Дата, Истина, ОтсутствуютНастройки);
	
	Если ОтсутствуютНастройки Тогда
		Возврат Неопределено;
	ИначеЕсли МассивСДатой.Количество() = 1 Тогда
		Возврат МассивСДатой[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуПредыдущегоРасчетаСЧА(СчетДоверительногоУправления, Дата, ОтсутствуютНастройки = Ложь) Экспорт
	
	Возврат ПолучитьДатуПредыдущегоДействия("СЧА", СчетДоверительногоУправления, Дата, ОтсутствуютНастройки);
	
КонецФункции

#КонецОбласти
